[Killed] BooleanLiteral
main/components/Nav/GithubLogin.js:12:7
   }
 
   // Add this null check for currentUser.root.user
-  if (!currentUser.root?.user) {
+  if (currentUser.root?.user) {
     return <span data-testid="GithubLogin-loading" />;
   }
killedBy: GithubLogin tests renders loading when currentUser.root is null
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] OptionalChaining
main/components/Nav/GithubLogin.js:12:8
   }
 
   // Add this null check for currentUser.root.user
-  if (!currentUser.root?.user) {
+  if (!currentUser.root.user) {
     return <span data-testid="GithubLogin-loading" />;
   }
killedBy: GithubLogin tests renders loading when currentUser.root is null
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] BlockStatement
main/components/Nav/GithubLogin.js:16:42
     return <span data-testid="GithubLogin-loading" />;
   }
 
-  if (currentUser.root.user.githubLogin) {
-    return (
-      <>
-        <Navbar.Text className="me-3" as={Link} to="/profile">
-          Github: {currentUser.root.user.githubLogin}
-        </Navbar.Text>
-      </>
-    );
-  }
+  if (currentUser.root.user.githubLogin) {}
   return (
     <>
killedBy: GithubLogin tests renders correctly for user logged into Google and Github
statusReason: Error: Unable to find an element with the text: Github: cgaucho-github. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <a
      class="btn btn-primary"
      href="/oauth2/authorization/github"

[Killed] ConditionalExpression
main/components/Nav/GithubLogin.js:16:7
     return <span data-testid="GithubLogin-loading" />;
   }
 
-  if (currentUser.root.user.githubLogin) {
+  if (true) {
     return (
       <>
killedBy: GithubLogin tests default link is the correct value
statusReason: Error: Unable to find an element with the text: Connect Github. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <a
      class="me-3 navbar-text"
      href="/profile"
