[Killed] BlockStatement
main/pages/Instructors/InstructorsIndexPage.js:24:30
     [],
   );
 
-  const createButton = () => {
-    return (
-      <Button
-        variant="primary"
-        href="/instructors/create"
-        style={{ float: "right" }}
-      >
-        New Instructor
-      </Button>
-    );
-  };
+  const createButton = () => {};
 
   return (
killedBy: InstructorsIndexPage tests Renders with New Instructor Button
statusReason: Error: Unable to find an element with the text: /New Instructor/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Instructors/InstructorsIndexPage.js:29:25
       <Button
         variant="primary"
         href="/instructors/create"
-        style={{ float: "right" }}
+        style={{ float: "" }}
       >
         New Instructor
killedBy: InstructorsIndexPage tests Renders with New Instructor Button
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
