[Killed] BlockStatement
main/components/Nav/GoogleLogin.js:4:76
 import { Button, Navbar } from "react-bootstrap";
 import { Link } from "react-router-dom";
 
-export default function GoogleLogin({ currentUser, systemInfo, doLogout }) {
-  var oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
-  return (
-    <>
-      {currentUser && currentUser.loggedIn && currentUser.root?.user ? (
-        <>
-          <Navbar.Text className="me-3" as={Link} to="/profile">
-            Welcome, {currentUser.root.user.email}
-          </Navbar.Text>
-          <Button onClick={doLogout}>Log Out</Button>
-        </>
-      ) : (
-        <Button href={oauthLogin}>Log In</Button>
-      )}
-    </>
-  );
-}
+export default function GoogleLogin({ currentUser, systemInfo, doLogout }) {}
 
killedBy: GoogleLogin tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Welcome, pconrad.cis@gmail.com. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
main/components/Nav/GoogleLogin.js:8:8
   var oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
   return (
     <>
-      {currentUser && currentUser.loggedIn && currentUser.root?.user ? (
+      {currentUser && currentUser.loggedIn || currentUser.root?.user ? (
         <>
           <Navbar.Text className="me-3" as={Link} to="/profile">
killedBy: GoogleLogin tests renders login button when currentUser is null
statusReason: TypeError: Cannot read properties of null (reading 'root')

[Killed] ConditionalExpression
main/components/Nav/GoogleLogin.js:8:8
   var oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
   return (
     <>
-      {currentUser && currentUser.loggedIn && currentUser.root?.user ? (
+      {false ? (
         <>
           <Navbar.Text className="me-3" as={Link} to="/profile">
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Welcome, pconrad.cis@gmail.com. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="App
