[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentForm.js:27:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && initialContents.id && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">ID</Form.Label>
-              <Form.Control
-                data-testid="RosterStudentForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
 
         <Col>
killedBy: RosterStudentForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="/RosterStudentForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentForm.js:27:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && initialContents.id && (
+        {true && (
           <Col>
             <Form.Group className="mb-3">
killedBy: RosterStudentForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentForm.js:51:28
               id="studentId"
               type="text"
               isInvalid={Boolean(errors.studentId)}
-              {...register("studentId", {
+              {...register("", {
                 required: "Student ID is required.",
               })}
killedBy: RosterStudentForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentForm.js:72:27
               type="text"
               isInvalid={Boolean(errors.firstName)}
               {...register("firstName", {
-                required: "First name is required.",
+                required: "",
               })}
             />
killedBy: RosterStudentForm tests shows validation errors for invalid inputs
statusReason: TestingLibraryElementError: Unable to find an element with the text: /First name is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RosterStudent/RosterStudentForm.js:91:40
               id="lastName"
               type="text"
               isInvalid={Boolean(errors.lastName)}
-              {...register("lastName", {
-                required: "Last name is required.",
-              })}
+              {...register("lastName", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RosterStudentForm tests shows validation errors for invalid inputs
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Last name is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentForm.js:92:27
               type="text"
               isInvalid={Boolean(errors.lastName)}
               {...register("lastName", {
-                required: "Last name is required.",
+                required: "",
               })}
             />
killedBy: RosterStudentForm tests shows validation errors for invalid inputs
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Last name is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
