[Killed] BlockStatement
main/components/RosterStudent/RosterStudentTable.js:9:50
 
 // Helper for DELETE request
 // Stryker disable StringLiteral : hard to test for string literals
-export const cellToAxiosParamsDelete = (cell) => {
-  return {
-    url: "/api/rosterstudents",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-};
+export const cellToAxiosParamsDelete = (cell) => {};
 // Stryker restore StringLiteral
 
killedBy: RosterStudentTable tests cellToAxiosParamsDelete returns the correct parameters
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"id": 5}, "url": "/api/rosterstudents"}
Received: undefined

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentTable.js:30:34
   const navigate = useNavigate();
 
   // Stryker disable next-line StringLiteral : hard to test for string literals
-  const editCallback = (cell) => {
-    navigate(`/rosterstudent/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: RosterStudentTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/rosterstudent/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ObjectLiteral
main/components/RosterStudent/RosterStudentTable.js:53:5
       Header: "id",
       accessor: "id", // accessor is the "key" in the data
     },
-    {
-      Header: "Enrollment Code",
-      accessor: "enrollmentCode",
-    },
+    {},
     {
       Header: "Student ID",
killedBy: RosterStudentTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentTable.js:75:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    // Stryker disable next-line BlockStatement : hard to test for block statements
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "RosterStudentTable"),
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "RosterStudentTable"),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: RosterStudentTable tests Edit button navigates to the edit page for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RosterStudentTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.js:78:53
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     // Stryker disable next-line BlockStatement : hard to test for block statements
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "RosterStudentTable"),
+      ButtonColumn("Edit", "primary", editCallback, ""),
     );
     columns.push(
killedBy: RosterStudentTable tests Edit button navigates to the edit page for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RosterStudentTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.js:81:30
       ButtonColumn("Edit", "primary", editCallback, "RosterStudentTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "RosterStudentTable"),
+      ButtonColumn("Delete", "", deleteCallback, "RosterStudentTable"),
     );
   }
killedBy: RosterStudentTable tests Delete button calls delete callback for admin user
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.js:81:56
       ButtonColumn("Edit", "primary", editCallback, "RosterStudentTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "RosterStudentTable"),
+      ButtonColumn("Delete", "danger", deleteCallback, ""),
     );
   }
killedBy: RosterStudentTable tests Delete button calls delete callback for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RosterStudentTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
