[Killed] StringLiteral
main/components/Users/RoleEmailForm.js:8:17
 function RoleEmailForm({
   initialContents,
   submitAction,
-  buttonLabel = "Add Email",
+  buttonLabel = "",
 }) {
   // Stryker disable all
killedBy: RoleEmailForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element with the text: /Add Email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Users/RoleEmailForm.js:33:22
           isInvalid={Boolean(errors.email)}
           {...register("email", {
             required: "Email is required.",
-            pattern: {
-              value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/, // email regex for simple fomatting validation
-              message: "Please enter a valid email address.",
-            },
+            pattern: {},
           })}
         />
killedBy: RoleEmailForm tests that the correct validations are performed
statusReason: TypeError: e is not a function

[Killed] Regex
main/components/Users/RoleEmailForm.js:34:22
           {...register("email", {
             required: "Email is required.",
             pattern: {
-              value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/, // email regex for simple fomatting validation
+              value: /[^\s@]+@[^\s@]+\.[^\s@]+$/, // email regex for simple fomatting validation
               message: "Please enter a valid email address.",
             },
killedBy: RoleEmailForm tests shows error on invalid email
statusReason: Error: Unable to find an element with the text: /Please enter a valid email address./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] Regex
main/components/Users/RoleEmailForm.js:34:22
           {...register("email", {
             required: "Email is required.",
             pattern: {
-              value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/, // email regex for simple fomatting validation
+              value: /^[^\s@]+@[^\s@]+\.[\s@]+$/, // email regex for simple fomatting validation
               message: "Please enter a valid email address.",
             },
killedBy: RoleEmailForm tests does not show error on valid email and submits
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />
