[Killed] ConditionalExpression
main/components/Users/RoleEmailTable.js:32:26
     defaultDeleteMutation.mutate(cell);
   };
 
-  const deleteCallback = customDeleteCallback || defaultDeleteCallback;
+  const deleteCallback = false;
 
   const columns = [
killedBy: RoleEmailTable tests Delete button calls delete callback
statusReason: TypeError: callback is not a function
