[Killed] BooleanLiteral
main/pages/Instructors/InstructorsCreatePage.js:7:61
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function InstructorsCreatePage({ storybook = false }) {
+export default function InstructorsCreatePage({ storybook = true }) {
   const objectToAxiosParams = (instructor) => ({
     url: "/api/admin/instructors/post",
killedBy: InstructorsCreatePage tests on submit, makes request to backend, and redirects to /admin/instructors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/admin/instructors"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/Instructors/InstructorsCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function InstructorsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (instructor) => ({
-    url: "/api/admin/instructors/post",
-    method: "POST",
-    params: {
-      email: instructor.email,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (instructor) => {
killedBy: InstructorsCreatePage tests on submit, makes request to backend, and redirects to /admin/instructors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/Instructors/InstructorsCreatePage.js:8:48
 import { toast } from "react-toastify";
 
 export default function InstructorsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (instructor) => ({
-    url: "/api/admin/instructors/post",
-    method: "POST",
-    params: {
-      email: instructor.email,
-    },
-  });
+  const objectToAxiosParams = (instructor) => ({});
 
   const onSuccess = (instructor) => {
killedBy: InstructorsCreatePage tests on submit, makes request to backend, and redirects to /admin/instructors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/Instructors/InstructorsCreatePage.js:10:13
 export default function InstructorsCreatePage({ storybook = false }) {
   const objectToAxiosParams = (instructor) => ({
     url: "/api/admin/instructors/post",
-    method: "POST",
+    method: "",
     params: {
       email: instructor.email,
killedBy: InstructorsCreatePage tests on submit, makes request to backend, and redirects to /admin/instructors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/Instructors/InstructorsCreatePage.js:16:37
     },
   });
 
-  const onSuccess = (instructor) => {
-    toast(`New instructor added - email: ${instructor.email}`);
-  };
+  const onSuccess = (instructor) => {};
 
   const mutation = useBackendMutation(
killedBy: InstructorsCreatePage tests on submit, makes request to backend, and redirects to /admin/instructors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New instructor added - email: testemailone@ucsb.edu"

Number of calls: 0

[Killed] StringLiteral
main/pages/Instructors/InstructorsCreatePage.js:17:11
   });
 
   const onSuccess = (instructor) => {
-    toast(`New instructor added - email: ${instructor.email}`);
+    toast(``);
   };
 
killedBy: InstructorsCreatePage tests on submit, makes request to backend, and redirects to /admin/instructors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New instructor added - email: testemailone@ucsb.edu"
Received: ""

Number of calls: 1
