[Killed] BlockStatement
src/main/utils/RoleEmailUtils.js:8:53
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell, role) {
-  return {
-    url: `/api/admin/${role.toLowerCase()}`,
-    method: "DELETE",
-    params: {
-      email: cell.row.values.email,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell, role) {}
 
killedBy: InstructorsIndexPage tests what happens when you click delete
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "first instructor deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] MethodExpression
src/main/utils/RoleEmailUtils.js:10:24
 
 export function cellToAxiosParamsDelete(cell, role) {
   return {
-    url: `/api/admin/${role.toLowerCase()}`,
+    url: `/api/admin/${role.toUpperCase()}`,
     method: "DELETE",
     params: {
killedBy: InstructorsIndexPage tests what happens when you click delete
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "first instructor deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
src/main/utils/RoleEmailUtils.js:10:10
 
 export function cellToAxiosParamsDelete(cell, role) {
   return {
-    url: `/api/admin/${role.toLowerCase()}`,
+    url: ``,
     method: "DELETE",
     params: {
killedBy: InstructorsIndexPage tests what happens when you click delete
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "first instructor deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
