[Killed] ArrowFunction
main/pages/Admins/AdminsCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function AdminsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (admin) => ({
-    url: "/api/admin/admins/post",
-    method: "POST",
-    params: {
-      email: admin.email,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (admin) => {
killedBy: AdminsCreatePage tests on submit, makes request to backend, and redirects to /admins
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/Admins/AdminsCreatePage.js:8:43
 import { toast } from "react-toastify";
 
 export default function AdminsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (admin) => ({
-    url: "/api/admin/admins/post",
-    method: "POST",
-    params: {
-      email: admin.email,
-    },
-  });
+  const objectToAxiosParams = (admin) => ({});
 
   const onSuccess = (admin) => {
killedBy: AdminsCreatePage tests on submit, makes request to backend, and redirects to /admins
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/Admins/AdminsCreatePage.js:9:10
 
 export default function AdminsCreatePage({ storybook = false }) {
   const objectToAxiosParams = (admin) => ({
-    url: "/api/admin/admins/post",
+    url: "",
     method: "POST",
     params: {
killedBy: AdminsCreatePage tests on submit, makes request to backend, and redirects to /admins
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New admin added - email: testemailone@ucsb.edu"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/Admins/AdminsCreatePage.js:16:32
     },
   });
 
-  const onSuccess = (admin) => {
-    toast(`New admin added - email: ${admin.email}`);
-  };
+  const onSuccess = (admin) => {};
 
   const mutation = useBackendMutation(
killedBy: AdminsCreatePage tests on submit, makes request to backend, and redirects to /admins
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New admin added - email: testemailone@ucsb.edu"

Number of calls: 0

[Killed] StringLiteral
main/pages/Admins/AdminsCreatePage.js:17:11
   });
 
   const onSuccess = (admin) => {
-    toast(`New admin added - email: ${admin.email}`);
+    toast(``);
   };
 
killedBy: AdminsCreatePage tests on submit, makes request to backend, and redirects to /admins
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New admin added - email: testemailone@ucsb.edu"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/Admins/AdminsCreatePage.js:33:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/admins" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: AdminsCreatePage tests on submit, makes request to backend, and redirects to /admins
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/admins"}

Number of calls: 0
