[Killed] ArrowFunction
main/pages/Admins/AdminsIndexPage.js:25:31
     [],
   );
 
-  const objectToAxiosParams = (cell) => ({
-    url: "/api/admin/admins",
-    method: "DELETE",
-    params: {
-      email: cell.row.values.email,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (response) => {
killedBy: AdminsIndexPage tests can delete an admin not in ADMIN_EMAILS user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Admin with email adminuno@example.com deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error deleting admin."

Number of calls: 2

[Killed] BlockStatement
main/pages/Admins/AdminsIndexPage.js:33:35
     },
   });
 
-  const onSuccess = (response) => {
-    toast(`Admin with email ${response.email} deleted`);
-  };
+  const onSuccess = (response) => {};
 
   const onError = (error) => {
killedBy: AdminsIndexPage tests can delete an admin not in ADMIN_EMAILS user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Admin with email adminuno@example.com deleted"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
main/pages/Admins/AdminsIndexPage.js:37:30
     toast(`Admin with email ${response.email} deleted`);
   };
 
-  const onError = (error) => {
-    const message = error.response.data;
-
-    if (error.response.status === 403 && typeof message === "string") {
-      toast.error(message);
-    } else {
-      toast.error("Error deleting admin.");
-    }
-  };
+  const onError = (error) => {};
 
   const deleteMutation = useBackendMutation(objectToAxiosParams, {
killedBy: AdminsIndexPage tests cannot delete an admin whos email is in ADMIN_EMAILS
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Attempting to delete admin in ADMIN_EMAILS"
Received: "Axios Error: Error: Request failed with status code 403"

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] EqualityOperator
main/pages/Admins/AdminsIndexPage.js:40:9
   const onError = (error) => {
     const message = error.response.data;
 
-    if (error.response.status === 403 && typeof message === "string") {
+    if (error.response.status !== 403 && typeof message === "string") {
       toast.error(message);
     } else {
killedBy: AdminsIndexPage tests cannot delete an admin whos email is in ADMIN_EMAILS
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Attempting to delete admin in ADMIN_EMAILS"
Received
       1: "Axios Error: Error: Request failed with status code 403"
       2: "Error deleting admin."

Number of calls: 2

[Killed] BlockStatement
main/pages/Admins/AdminsIndexPage.js:40:71
   const onError = (error) => {
     const message = error.response.data;
 
-    if (error.response.status === 403 && typeof message === "string") {
-      toast.error(message);
-    } else {
+    if (error.response.status === 403 && typeof message === "string") {} else {
       toast.error("Error deleting admin.");
     }
killedBy: AdminsIndexPage tests cannot delete an admin whos email is in ADMIN_EMAILS
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Attempting to delete admin in ADMIN_EMAILS"
Received: "Axios Error: Error: Request failed with status code 403"

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/pages/Admins/AdminsIndexPage.js:42:12
 
     if (error.response.status === 403 && typeof message === "string") {
       toast.error(message);
-    } else {
-      toast.error("Error deleting admin.");
-    }
+    } else {}
   };
 
killedBy: AdminsIndexPage tests shows generic error message on unexpected error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error deleting admin."
Received
       1: "Error communicating with backend via GET on /api/admin/admins"
       2: "Axios Error: Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/Admins/AdminsIndexPage.js:47:66
     }
   };
 
-  const deleteMutation = useBackendMutation(objectToAxiosParams, {
-    onSuccess,
-    onError,
-  });
+  const deleteMutation = useBackendMutation(objectToAxiosParams, {});
 
   const deleteCallback = async (cell) => {
killedBy: AdminsIndexPage tests can delete an admin not in ADMIN_EMAILS user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Admin with email adminuno@example.com deleted"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
main/pages/Admins/AdminsIndexPage.js:56:30
     deleteMutation.mutate(cell);
   };
 
-  const createButton = () => {
-    return (
-      <Button
-        variant="primary"
-        href="/admin/admins/create"
-        style={{ float: "right" }}
-      >
-        New Admin
-      </Button>
-    );
-  };
+  const createButton = () => {};
 
   return (
killedBy: AdminsIndexPage tests Renders with New Admin Button
statusReason: Error: Unable to find an element with the text: /New Admin/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Admins/AdminsIndexPage.js:61:25
       <Button
         variant="primary"
         href="/admin/admins/create"
-        style={{ float: "right" }}
+        style={{ float: "" }}
       >
         New Admin
killedBy: AdminsIndexPage tests Renders with New Admin Button
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
