[Killed] BlockStatement
main/pages/Admins/AdminsCreatePage.js:33:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/admin/admins" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: AdminsCreatePage tests on submit, makes request to backend, and redirects to /admin/admins
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/admin/admins"}

Number of calls: 0
