[Killed] StringLiteral
main/pages/Admins/AdminsIndexPage.js:29:10
   );
 
   const objectToAxiosParams = (cell) => ({
-    url: "/api/admin/admins",
+    url: "",
     method: "DELETE",
     params: {
killedBy: AdminsIndexPage tests can delete an admin not in ADMIN_EMAILS user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Admin with email adminuno@example.com deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error deleting admin."

Number of calls: 2

[Killed] StringLiteral
main/pages/Admins/AdminsIndexPage.js:30:13
 
   const objectToAxiosParams = (cell) => ({
     url: "/api/admin/admins",
-    method: "DELETE",
+    method: "",
     params: {
       email: cell.row.values.email,
killedBy: AdminsIndexPage tests can delete an admin not in ADMIN_EMAILS user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Admin with email adminuno@example.com deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error deleting admin."

Number of calls: 2

[Killed] BlockStatement
main/pages/Admins/AdminsIndexPage.js:36:35
     },
   });
 
-  const onSuccess = (response) => {
-    toast(`Admin with email ${response.email} deleted`);
-    queryClient.invalidateQueries({ queryKey: ["/api/admin/admins/all"] });
-  };
+  const onSuccess = (response) => {};
 
   const onError = (error) => {
killedBy: AdminsIndexPage tests can delete an admin not in ADMIN_EMAILS user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Admin with email adminuno@example.com deleted"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ConditionalExpression
main/pages/Admins/AdminsIndexPage.js:44:9
   const onError = (error) => {
     const message = error.response.data;
 
-    if (error.response.status === 403 && typeof message === "string") {
+    if (false) {
       toast.error(message);
     } else {
killedBy: AdminsIndexPage tests cannot delete an admin whos email is in ADMIN_EMAILS
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Attempting to delete admin in ADMIN_EMAILS"
Received
       1: "Axios Error: Error: Request failed with status code 403"
       2: "Error deleting admin."

Number of calls: 2

[Killed] StringLiteral
main/pages/Admins/AdminsIndexPage.js:47:19
     if (error.response.status === 403 && typeof message === "string") {
       toast.error(message);
     } else {
-      toast.error("Error deleting admin.");
+      toast.error("");
     }
   };
killedBy: AdminsIndexPage tests shows generic error message on unexpected error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error deleting admin."
Received
       1: "Error communicating with backend via GET on /api/admin/admins/all"
       2: "Axios Error: Error: Request failed with status code 404"
       3: ""
