[Killed] BlockStatement
main/components/RosterStudent/RosterStudentTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/rosterstudent/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/rosterstudent/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.js:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/rosterstudent/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/rosterstudent/edit/1"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.js:44:15
     },
 
     {
-      Header: "Student ID",
+      Header: "",
       accessor: "studentId",
     },
killedBy: RosterStudentTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Student ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/RosterStudent/RosterStudentTable.js:47:5
       Header: "Student ID",
       accessor: "studentId",
     },
-    {
-      Header: "First Name",
-      accessor: "firstName",
-    },
+    {},
     {
       Header: "Last Name",
killedBy: RosterStudentTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
