[Killed] BlockStatement
src/main/utils/RosterStudentUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/rosterstudent",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: RosterStudentTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'params')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table
