[Killed] BlockStatement
main/pages/Admins/AdminsIndexPage.js:36:32
     },
   });
 
-  const onSuccess = (email) => {
-    toast(`Admin with email ${email} deleted`);
-    queryClient.invalidateQueries({ queryKey: ["/api/admin/admins/all"] });
-  };
+  const onSuccess = (email) => {};
 
   const onError = (error) => {
killedBy: AdminsIndexPage tests can delete an admin not in ADMIN_EMAILS user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Admin with email adminuno@example.com deleted"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
main/pages/Admins/AdminsIndexPage.js:55:42
     onError,
   });
 
-  const deleteCallback = async (cell) => {
-    deleteMutation.mutate(cell, {
-      onSuccess: () => onSuccess(cell.row.values.email),
-    });
-  };
+  const deleteCallback = async (cell) => {};
 
   const createButton = () => {
killedBy: AdminsIndexPage tests can delete an admin not in ADMIN_EMAILS user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Admin with email adminuno@example.com deleted"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ObjectLiteral
main/pages/Admins/AdminsIndexPage.js:56:33
   });
 
   const deleteCallback = async (cell) => {
-    deleteMutation.mutate(cell, {
-      onSuccess: () => onSuccess(cell.row.values.email),
-    });
+    deleteMutation.mutate(cell, {});
   };
 
killedBy: AdminsIndexPage tests can delete an admin not in ADMIN_EMAILS user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Admin with email adminuno@example.com deleted"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ArrowFunction
main/pages/Admins/AdminsIndexPage.js:57:18
 
   const deleteCallback = async (cell) => {
     deleteMutation.mutate(cell, {
-      onSuccess: () => onSuccess(cell.row.values.email),
+      onSuccess: () => undefined,
     });
   };
killedBy: AdminsIndexPage tests can delete an admin not in ADMIN_EMAILS user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Admin with email adminuno@example.com deleted"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ObjectLiteral
main/pages/Admins/AdminsIndexPage.js:66:16
       <Button
         variant="primary"
         href="/admin/admins/create"
-        style={{ float: "right" }}
+        style={{}}
       >
         New Admin
killedBy: AdminsIndexPage tests Renders with New Admin Button
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
